[
  {
    "thumbnail": "../assets/projects/collabowrite-thumbnail.png",
    "name": "CollaboWrite",
    "date": "October 2016",
    "technologies": "Angular 1.x, Express, Node, Twitter OAuth, PostgreSQL",
    "description": "CollaboWrite is collaborative story telling platform that allows users to write and illustrate collaborative stories.",
    "blurb": "CollaboWrite is a storytelling platform.",
    "descriptionLong1": "As a user, you can create an account by signing up with Twitter. You can browse stories, add chapters to any other user stories and create your own stories. You can choose a genre or leave it open and update story details at any point. You also have a dashboard where you can track the stories you own, the stories you've contributed to and the stories you've marked as favorites.",
    "descriptionLong2": "Upcoming features include the ability to approve or reject contributions, track a story's progress across the world with an interactive map and drawing comic book style panels for chapter contributions.",
    "features": "Login with Twitter, Create stories and edit details at any time, Contribute to any story by writing new chapters, Search for stories by genre, Save favorites, Keep track of all activity via Dashboard",
    "github": "https://github.com/elanalynn/collabowrite",
    "url": "https://collabowrite.elanalynn.com",
    "detail": "root.collabowrite"
  },{
    "thumbnail": "../assets/projects/stumblr-thumbnail.jpg",
    "name": "Stumblr",
    "date": "February 2016",
    "technologies": "React, Express, Twitter OAuth, MongoDB, Bootstrap",
    "description": "Stumblr is pub crawl planning app that maps a route based on your location (or an address) and your preferences.",
    "blurb": "Stumblr maps your best barcrawl.",
    "descriptionLong1": "Stumblr is pub crawl planner that maps a barhopping route based on your current location or a specific address. The app asks you to select the level of barcrawl you would like to do - from '5k' (3 bars) to 'Marathon' (10 bars!). When you head to the first bar and order a drink, you can check in. If you complete the route, you earn a badge. As you accumulate badges, you can earn even more badges. Frequency and distance matters too! You can also earn badges for cutting your bar crawl short... but I don't know if you want to show those off to your friends.",
    "descriptionLong2": "This was a collaboration with two other students. It was our first exposure to React, MongoDB and OpenShift.",
    "features": "Login with Twitter, Customize tweet settings and dashboard settings, Create a route based on location and route preferences, Save routes and see their statuses, View your route on a Google Map, Check in, skip and focus on bars on the map, Earn badges based on the type and number of routes you complete, Tweet when you check in and earn badges, Connect to Uber when you end a route.",
    "github": "https://github.com/designatedDrinkers/stumblr",
    "url": "http://stumblr-club.herokuapp.com/",
    "detail": "root.stumblr"
  },{
    "thumbnail": "../assets/projects/planit-thumbnail.jpg",
    "name": "Planit",
    "date": "January 2016",
    "technologies": "JavaScript, Node, Express, PostgreSQL, LinkedIn OAuth, Bootstrap",
    "description": "Planit is an event human resources marketplace. Create events and get help or sign up to work events you qualify for.",
    "blurb": "Planit is an event HR marketplace.",
    "descriptionLong1": "Planit is an event management marketplace with a universal theme.",
    "descriptionLong2": "While I collaborated on many of the pieces, the majority of my focus was on the views and client-side javascript.",
    "features": "Log in with LinkedIn, Customize your profile, Create and own events, Add tasks, Review (and accept or reject) proposals, Propose work for event owners' tasks based the qualifications listed in your profile.",
    "github": "https://github.com/elanalynn/Planit",
    "url": "http://planit.space",
    "detail": "root.planit"
  },{
    "thumbnail": "../assets/projects/weeks-thumbnail.jpg",
    "name": "Your Life in Weeks",
    "technologies": "JavaScript, jQuery, Bootstrap, Google Maps API",
    "description": "An interactive way to save and visualize events from each week and see how they populate a grid of your life.",
    "blurb": "Visualize your Life in Weeks",
    "descriptionLong1": "I came across a graphical visualization of a life in weeks via WaitButWhy.com. Weeks were represented by simple squares, arranged in rows of 52 to represent a year. I fell in love with the diagram so I immediately printed the page and started marking it up. It wasn’t long before I hit the inevitable limitation of interactivity that comes with a sheet of paper. I thought, wouldn’t this be cool if it was a web application? This is my attempt at making “Your Life in Weeks” interactive.",
    "descriptionLong2": "I created this for a front-end assignment in the fifth week of bootcamp. I used Bootstrap, jQuery and localStorage to persist the life events to the best of my ability at the time. I am currently working on rewriting this project as a full stack application.",
    "features": "Save events on a grid, Color code events by type, Pinpoint events on a map, Click through events to pull up details",
    "github": "https://github.com/ekopelevich/your_life_in_weeks",
    "url": "/weeks/demo",
    "detail": "root.weeks"
  }
]
